---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetMaterialGroup(System.Int32)
source: html/51b9427d-cfef-30be-45cf-fb282212a9a5.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetMaterialGroup Method

Gets material group from its identifier.

## Syntax (C#)
```csharp
public string GetMaterialGroup(
	int materialId
)
```

## Parameters
- **materialId** (`System.Int32`) - The material identifier.

## Returns
The material group.